app/views/prescriptions/index.html.erb

          <% @patients.each do |patient| %>
            <% patient.prescriptions.where(created: true).each do |prescription| %>
---
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."patient_id" = ? AND "prescriptions"."created" = ?  [["patient_id", 10], ["created", 1]]