app/views/patients/index.html.erb

SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."patient_id" IN (?, ?, ?, ?, ?, ?)  [["patient_id", 3], ["patient_id", 1], ["patient_id", 4], ["patient_id", 6], ["patient_id", 5], ["patient_id", 2]]
SELECT COUNT(*) FROM "prescriptions" WHERE "prescriptions"."patient_id" = ?  [["patient_id", 3]]
---
              <td class="text-center">
                <span class="badge bg-primary"><%= patient.prescriptions.count %></span>

SELECT COUNT(*) FROM "prescriptions" WHERE "prescriptions"."patient_id" = ?  [["patient_id", 3]]
---
        <div class="col-md-3">
          <h4 class="text-info"><%= @patients.sum { |p| p.prescriptions.count } %></h4>