app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" ORDER BY "patients"."name" ASC
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."patient_id" IN (?, ?, ?, ?, ?, ?)  [["patient_id", 3], ["patient_id", 1], ["patient_id", 4], ["patient_id", 6], ["patient_id", 5], ["patient_id", 2]]
---
  def index
    @patients = Patient.includes(:prescriptions).order(:name)

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]
---
  def destroy
    @patient.destroy

DELETE FROM "prescriptions" WHERE "prescriptions"."id" = ?  [["id", 1]]
---
  def clear_prescriptions
    @patient.prescriptions.destroy_all

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 17]]
---
  def reset_all
    Patient.destroy_all

SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_patient
    @patient = Patient.find(params[:id])