app/controllers/prescriptions_controller.rb

  def index
    @patients = Patient.includes(:prescriptions)
                       .select(&:has_created_prescriptions?)
                       .sort_by { |p| [-p.total_fills, p.total_income] }
    @report_generated = @patients.any?
---
SELECT "patients".* FROM "patients"
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."patient_id" IN (?, ?, ?, ?, ?, ?)  [["patient_id", 1], ["patient_id", 2], ["patient_id", 3], ["patient_id", 4], ["patient_id", 5], ["patient_id", 6]]
SELECT 1 AS one FROM "prescriptions" WHERE "prescriptions"."patient_id" = ? AND "prescriptions"."created" = ? LIMIT ?  [["patient_id", 1], ["created", 1], ["LIMIT", 1]]

  def new
    @prescription = Prescription.new
    @patients = Patient.all.order(:name)
---
SELECT "patients".* FROM "patients" ORDER BY "patients"."name" ASC

  def create
    patient = Patient.find_or_create_by!(name: prescription_params[:patient_name])
    @prescription = patient.prescriptions.build(
      drug_name: prescription_params[:drug_name],
      created: prescription_params[:created] == '1',
      fill_count: prescription_params[:fill_count].to_i,
      return_count: prescription_params[:return_count].to_i
    )

    if @prescription.save
---
INSERT INTO "prescriptions" ("patient_id", "drug_name", "created", "fill_count", "return_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["patient_id", 8], ["drug_name", "Paxil"], ["created", 1], ["fill_count", 0], ["return_count", 0], ["created_at", "2025-11-30 19:16:22.431183"], ["updated_at", "2025-11-30 19:16:22.431183"]]
INSERT INTO "patients" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Allen Taylor"], ["created_at", "2025-11-30 22:43:40.451092"], ["updated_at", "2025-11-30 22:43:40.451092"]]
SELECT "patients".* FROM "patients" WHERE "patients"."name" = ? LIMIT ?  [["name", "Allen Taylor"], ["LIMIT", 1]]
INSERT INTO "prescriptions" ("patient_id", "drug_name", "created", "fill_count", "return_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["patient_id", 32], ["drug_name", "Aspirin"], ["created", 1], ["fill_count", 0], ["return_count", 0], ["created_at", "2025-11-30 22:43:40.491065"], ["updated_at", "2025-11-30 22:43:40.491065"]]

  def edit
    @patients = Patient.all.order(:name)
---
SELECT "patients".* FROM "patients" ORDER BY "patients"."name" ASC

  def update
    if prescription_params[:patient_name].present?
      patient = Patient.find_or_create_by!(name: prescription_params[:patient_name])
      @prescription.patient = patient
    end

    if @prescription.update(prescription_params.except(:patient_name))
---
SELECT "patients".* FROM "patients" WHERE "patients"."name" = ? LIMIT ?  [["name", "TestPatient33"], ["LIMIT", 1]]
UPDATE "prescriptions" SET "drug_name" = ?, "updated_at" = ? WHERE "prescriptions"."id" = ?  [["drug_name", "aspartate"], ["updated_at", "2025-11-30 22:23:00.948262"], ["id", 38]]

  def destroy
    patient = @prescription.patient
    @prescription.destroy

    # Clean up patient if they have no more prescriptions
    patient.destroy if patient.prescriptions.empty?
---
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 19]]
DELETE FROM "prescriptions" WHERE "prescriptions"."id" = ?  [["id", 27]]
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."patient_id" = ?  [["patient_id", 19]]
SELECT 1 AS one FROM "prescriptions" WHERE "prescriptions"."patient_id" = ? LIMIT ?  [["patient_id", 18], ["LIMIT", 1]]

  def set_prescription
    @prescription = Prescription.find(params[:id])
---
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]