app/models/patient.rb

  def get_or_create_prescription(drug_name)
    prescriptions.find_or_create_by!(drug_name: drug_name)
---
INSERT INTO "prescriptions" ("patient_id", "drug_name", "created", "fill_count", "return_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["patient_id", 1], ["drug_name", "A"], ["created", 0], ["fill_count", 0], ["return_count", 0], ["created_at", "2025-11-30 18:41:40.329874"], ["updated_at", "2025-11-30 18:41:40.329874"]]